Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/colors.po
Languages: ru

source: Color Management
ru: Работа с цветом

source: Table of Contents
ru: Содержание

source: Gamma Overview
ru: Общее описание

source: The essence of gamma correction is packing the image brightness channel into 8 bits of information.
ru: Сущность гамма-коррекции заключается в упаковке яркости канала изображения в 8 битах информации.

source: Standard (non-HDR) images are always stored in non-linear color space where the darker components are encoded using more bits than the brighter ones. That means that a bigger RGB value corresponds to 0.5 of the real light intensity (a physical quantity called illuminance) - in the simplest case this value equals to 0.5 ^ (1/2.2) = 0.73.
ru: Стандартные (не HDR) изображения всегда сохраняются в нелинейном пространстве, где тёмные компоненты кодируются большим числом битов чем светлые. Это означает, что значению 0.5 от реальной интенсивности света (физической величины, называемой освещённость) будет соответствовать большее значение, содержащееся в каналах RGB (в самом простом случае :math:`0.5^{1/2.2} = 0.73)`.

source: Otherwise, 8 bit of information will not be enough to encode the light intensity. This will result in incorrect rendering of darker tones. For example, dark gradients will look stepped.
ru: В противном случае 8 бит информации не достаточно для кодирования интенсивности света, что приведёт к тому, что тёмные тона будут отображаться некорректно (например, тёмный градиент будет иметь ступенчатый характер переходов между соседними цветами).

source: Therefore, web browsers, as well as many other programs for viewing and manipulating images, work in non-linear space. However, 3D engines and renderers work in linear space, because it is the only correct way to represent light behavior in the real world. For example, the illuminance from two identical lamps exceeds the illuminance from one lamp exactly by two times.
ru: Таким образом, веб-браузеры, как и многие другие программы для просмотра и обработки изображений, работают в нелинейном цветовом пространстве. Однако трёхмерные движки и рендереры работают в линейном пространстве, поскольку только оно может адекватно представлять поведение света в реальном мире. Например, освещённость от двух одинаковых ламп будет ровно в два раза превышать освещённость только от одной.

source: Undoubtedly, 8 bit of information will not be enough in this case. This can be clearly seen from the table in which approximate illuminance values for some real light sources are shown.
ru: Безусловно, в таком случае 8 бит информации не будет достаточно, что наглядно иллюстрирует таблица, в которой приведены примерные значения величин освещённости от реальных источников.

source: Description
ru: Описание

source: Illuminance, lux
ru: Освещённость, лк

source: Summer noon
ru: Летом в полдень

source: Winter noon
ru: Зимой в полдень

source: Dull day
ru: В пасмурный день

source: In a light room
ru: В светлой комнате

source: Full moon by night
ru: Ночью в полнолуние

source: Moonless light
ru: В безлунную ночь

source: When the ``Color Management > Display Device > sRGB`` option is enabled for a scene, Blender works in a linear space. Material colors and lamp settings correspond to physical values. For texture images (except normal maps) it is required to select the ``Image > Input Color Space > sRGB`` option. In this case an automatic image unpacking (sRGB -> Linear) is performed at the time of rendering.
ru: Blender при настройке сцены ``Color Management > Display Device > sRGB`` работает в линейном пространстве. Значения цветов материалов и настройки источников света соответствует физическим величинам. При работе с текстурами, за исключением карт нормалей необходимо выставить настройку изображения ``Image > Input Color Space > sRGB``. В этом случае при рендеринге будет производится автоматическая распаковка изображения: sRGB->Linear.

source: Human Vision and Monitors
ru: Человеческое зрение и мониторы

source: While the human vision is non-linear (a human recognizes the darker light tints better than the brighter ones), the light coming into the eye still obeys the physical laws (see the lamps example).
ru: Человеческое восприятие света нелинейно (человек лучше различает градации тусклого света чем яркого), однако свет, поступающий в глаз, по-прежнему должен подчиняться физическим законам (см. пример с лампочками).

source: In CRT monitors the brightness is dependent non-linearly upon the electric voltage applied to the monitor’s input (the voltage itself is determined by the color channel value in the video memory). LCD monitors mimic the same characteristics. Nevertheless, the light emitted by such monitors obeys the physical laws. For example the addition of a second light source to a virtual scene should cause the brightness to double (in the perfect case).
ru: Мониторы с электронно-лучевыми трубками (ЭЛТ) имеют нелинейную характеристику яркости от приложенного к их входу электрического напряжения, которое, в свою очередь, определяется значением канала цветности в видеопамяти. Подобную же характеристику копируют жидкокристаллические мониторы. Тем не менее свет, излучаемый такими мониторами, по-прежнему должен подчиняться физическим законам. Например, в идеальном случае при добавлении второго источника света на сцену в виртуальном мире, яркость пикселей на экране монитора должна увеличиваться в два раза.

source: Therefore, the perception characteristics of the human eye are the reason due to which it is possible to pack color channels. At the same time, the technical characteristics of monitors have a secondary significance for gamma correction.
ru: Таким образом, особенности восприятия человеческого глаза являются причиной, по которой стало возможным осуществлять упаковку каналов цветности, в то время как технические характеристики мониторов имеют вторичное значение по отношению к гамма-коррекции.

source: Gamma Formula
ru: Гамма

source: Used in the following simplified formula:
ru: Используется в следующей упрощенной формуле:

source: γ < 1 - packing gamma, γ > 1 - unpacking gamma. In the simplest case 1/2.2 and 2.2 values are used respectively. Hereinafter the \“packing\” (Linear -> sRGB) and \“unpacking\” (sRGB -> Linear) terms are used instead of \“gamma correction\”.
ru: γ < 1 - упаковывающая гамма, γ > 1 - распаковывающая гамма. В наиболее простом случае используются значения 1/2.2 и 2.2 соответственно. Далее вместо термина "гамма-коррекция" будут использованы термины "упаковка" (Linear -> sRGB) и "распаковка" (sRGB -> Linear).

source: Gamma in Node Materials
ru: Коррекция в нодовых материалах

source: Nodes for Coloring
ru: Ноды для окраски

source: Unpacking (sRGB -> Linear) is required when textures and vertex colors are used for coloring (not for masking). The texture node and Vertex Color output of Geometry node implement unpacking automatically.
ru: При использовании текстур и вертексных цветов для окраски (не в качестве масок), необходима распаковка (sRGB -> Linear). Выход `Vertex Color` ноды `Geometry` и нода текстуры реализуют распаковку автоматически.

source: Note that the alpha channel of a texture node is not corrected. Its values are in the linear space.
ru: Отметим, что альфа-канал ноды текстуры коррекции не подвергается, его значения находятся в линейном пространстве.

source: Nodes for Masking
ru: Ноды для масок

source: Textures and vertex colors can be used as masks i.e. input data for some mathematical operations. In such a case the packing operation is required.
ru: Текстуры и вертексные цвета могут использоваться в качестве масок, т.е. для смешения цветов или других математических операций. В таком случае необходима упаковка (Linear -> sRGB).

source: Keep in mind that a texture node and `Vertex Color` output of `Geometry` node implement unpacking automatically. This results in necessity of the additional transformation back to the non-linear space, for which the `LINEAR_TO_SRGB` or `GAMMA` node with γ = 1/2.2 is used.
ru: Следует обратить внимание, что выход `Vertex Color` ноды `Geometry` и нода текстуры реализуют распаковку автоматически. Это приводит к необходимости дополнительного преобразования обратно в нелинейное пространство, для чего используется специальная нода `LINEAR_TO_SRGB` или нода `GAMMA` со значением γ = 1/2.2.

source: `LINEAR_TO_SRGB` and `SRGB_TO_LINEAR` nodes are deprecated. `GAMMA` node should be used instead.
ru: Нода `LINEAR_TO_SRGB` считается устаревшей, следует использовать ноду `GAMMA`.

source: Normal Maps
ru: Карты нормалей

source: No transformations are performed for normal maps.
ru: При использовании карт нормалей никакие преобразования не производятся.

source: Summary Table
ru: Сводная таблица коррекции в нодовых материалах

source: Use case
ru: Случай использования

source: Correction
ru: Коррекция

source: Texture for coloring
ru: Текстура для окраски

source: implemented automatically in the texture node (the alpha channel is not corrected)
ru: реализуется автоматически в ноде текстуры (альфа-канал коррекции не подвергается)

source: Texture for masking
ru: Текстура для маски

source: GAMMA with γ = 0.45
ru: GAMMA со значением γ = 0.45

source: Vertex color for coloring
ru: Вертексный цвет для окраски

source: implemented automatically
ru: реализуется автоматически

source: Vertex color for masking
ru: Вертексный цвет для маски

source: Normal map
ru: Карта нормалей

source: not required
ru: не требуется

source: Alpha Compositing
ru: Альфа-композитинг

source: Overview
ru: Общие сведения

source: Physically correct alpha compositing is performed according to the formula [`source <http://www.cs.princeton.edu/courses/archive/spring05/cos426/papers/smith95a.pdf>`_]:
ru: Физически корректный альфа-композитинг осуществляется по формуле [`источник <http://www.cs.princeton.edu/courses/archive/spring05/cos426/papers/smith95a.pdf>`_]:

source: This formula differs from the classic mix operation (aka convex combination) because it has the :math:`\alpha_b` multiplier in the second summand. Therefore, not only the :math:`\alpha_a` value of the source pixel should be known for alpha compositing, but also the :math:`\alpha_b` value of the pixel over which the rendering is performed.
ru: Формула отличается от классической операции смешивания (mix, выпуклая комбинация) наличием множителя :math:`\alpha_b` во втором слагаемом. Таким образом, для осуществления альфа-композитинга должно быть известно не только значение :math:`\alpha_a` пикселя-источника, но и значение :math:`\alpha_b` пикселя, поверх которого осуществляется рендеринг.

source: In case of preliminary multiplication of the :math:`\alpha` values by the color channels (so called premultiplied alpha) the formula becomes as following:
ru: В случае предварительного умножения значений :math:`\alpha` на цветовые каналы (т.н. premultiplied alpha) формула принимает вид:

source: The last formula is used also to calculate the resulting :math:`\alpha_o` value:
ru: Последняя формула используется также для расчёта результирующего значения :math:`\alpha_o`:

source: Preliminary multiplication of the color channels by the :math:`\alpha` values allows to save two multiplication operations. The more significant thing is that the derived formula can be used repeatedly without the need to divide the :math:`C_o` color by the :math:`\alpha_o` value on each consequent iteration.
ru: Предварительное умножение цветовых каналов на значения :math:`\alpha` позволяет сэкономить две операции умножения. Еще более существенным является тот факт, что полученная формула может использоваться многократно, без необходимости деления цвета :math:`C_o` на значение :math:`\alpha_o` на каждой последующей итерации.

source: Implementation
ru: Реализация

source: The blending function used in Blend4Web is the following:
ru: Функция смешивания в движке Blend4Web имеет вид:

source: WebGL context initialization is performed using the premultipliedAlpha = true parameter (that is the default value). Also multiplication of all the color channels by the :math:`\alpha` value is performed on the output of the shaders.
ru: Инициализация контекста WebGL производится с параметром `premultipliedAlpha = true` (что является значением по умолчанию). Кроме того, на выходе шейдеров производится умножение всех каналов цветности на значение :math:`\alpha`.

source: Color Correction
ru: Коррекция цвета

source: Activation
ru: Активация

source: Activate the ``Color Correction`` panel under the ``Render`` tab.
ru: Активировать панель ``Color Correction`` во вкладке ``Render``.

source: Additional settings
ru: Дополнительные настройки

source: The default value is 0.0.
ru: Яркость. Значение по умолчанию 0.0.

source: The default value is 1.0.
ru: Экспозиция. Значение по умолчанию 1.0.
