Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/developers_advanced.po
Languages: ru

source: For Engine Developers
ru: Разработчикам движка

source: Table of Contents
ru: Содержание

source: Coding Style
ru: Стиль оформления кода

source: This engine uses structural programming. The code is organized in modules. OOP methods are not used, classes are not defined, inheritance is not performed and so on.
ru: В движке применяется структурное программирование. Код организуется в модули. Подходы ООП не используются, классы не определяются, наследование не осуществляется и т.п.

source: The `K&R style <http://en.wikipedia.org/wiki/1_true_brace_style#K.26R_style>`_ is used except for the fact that the opening bracket for a compound operator is placed on the same line, for example:
ru: Используется `K&R стиль <http://en.wikipedia.org/wiki/1_true_brace_style#K.26R_style>`_, за исключением того, что открывающая скобка для составного оператора ставится на той же строке, например:

source: 4 spaces are used for indentation (no tabs allowed).
ru: Для выравнивания используются 4 пробела (табуляция запрещена).

source: Examples
ru: Примеры

source: The underscore symbol is used in function and variable names:
ru: В именах переменных и функций используется знак подчеркивания:

source: All global variables begin with an underscore:
ru: Все глобальные переменные начинаются со знака подчеркивания:

source: The constants are written in capital letters and never begin with an underscore:
ru: Константы пишутся прописными буквами и никогда не начинаются со знака подчеркивания:

source: The names of external API methods and properties are written after a point. To avoid obfuscation of fields they must be listed with the ``@cc_externs`` tag:
ru: Для внешних API названия методов и свойств задаются через точку. Поля, требующие защиту от обфускации, помещаются в специальный тэг ``@cc_externs``:

source: Commenting is in English only. Comment style - JSDoc.
ru: Комментарии только на английском языке. Стиль комментирования - JSDoc.

source: Building the Engine
ru: Сборка движка

source: Before building please make sure that your system has all required dependencies installed (see the :ref:`table <dependencies>`).
ru: Перед сборкой необходимо убедиться, что в системе присутствуют все необходимые зависимости, для чего следует свериться с :ref:`таблицей <dependencies>`.

source: To compile the engine and the applications included into the SDK please execute the following command (in the SDK root):
ru: Для компиляции движка и входящих в SDK приложений достаточно выполнить команду из корневой директории SDK:

source: The full building that includes converting resources (textures, sounds and videos), compilation and converting the docs, can be performed with the following command:
ru: Полная сборка, включающая конвертацию ресурсов (текстур, звуков и видео), компиляцию и подготовку документации вызывается командой:

source: Building the archives with the distributions:
ru: Сборка архивов с дистрибутивами:

source: All above mentioned operations can be performed with a single command:
ru: Все вышеперечисленные операции могут быть выполнены одной командой:

source: Building the Add-on
ru: Сборка аддона

source: Binary Blend4Web addon builds are available for the following platforms: Linux x32/64, macOS x64, Windows x32/64. At the same time users can compile the addon by themselves.
ru: Бинарные сборки аддона Blend4Web подготовлены для следующих платформ: Linux x32/64, macOS x64, Windows x32/64. В то же время пользователи имеют возможность произвести сборку самостоятельно.

source: To do this Python 3.x (it's better if it's the same version as in Blender) and a C compiler are required. Under Linux it's enough to install the python3-dev and build-essential packages.
ru: Для этого необходимо наличие Python 3.x (желательно, чтобы версия была эквивалентна используемой в Blender) и компилятора языка C (в Linux достаточно установить пакеты python3-dev и build-essential).

source: Paths relative to the repository root:
ru: Пути относительно корневой директории SDK:

source: build script: ``csrc/b4w_bin/build.py``
ru: скрипт сборки: ``csrc/b4w_bin/build.py``

source: Blend4Web addon: ``addons/blend4web/``
ru: аддон Blend4Web: ``blender_scripts/addons/blend4web/``

source: The building process is started in the following way:
ru: Запуск сборки осуществляется следующим образом:

source: As a result of the building you'll get a binary file called:
ru: Результатом сборки будет бинарный файл с именем:

source: ``b4w_bin_[PLATFORM]_[ARCHITECTURE].[STANDARD_EXTENSION]``,
ru: ``b4w_bin_[ПЛАТФОРМА]_[АРХИТЕКТУРА].[СТАНДАРТНОЕ_РАСШИРЕНИЕ]``,

source: located in the same directory as the addon. Example: ``b4w_bin_Linux_64.so``. After this the addon is ready to use under this platform.
ru: размещенный в каталоге с аддоном. Пример: ``b4w_bin_Linux_64.so``. После этого аддон станет готовым к использованию на данной платформе.

source: Dependencies
ru: Зависимости

source: All dependencies are listed in the table below in order of decreasing importance.
ru: В таблице ниже перечислены все зависимости, в порядке убывания важности для разработки.

source: Name
ru: Название

source: Purpose
ru: Назначение

source: included by default
ru: в составе по умолчанию

source: script interpreter
ru: интерпретатор скриптов

source: compiling shaders
ru: компиляция шейдеров

source: compiling and obfuscating the engine modules
ru: компиляция и обфускация модулей движка

source: converting textures
ru: конвертация текстур

source: converting media resources
ru: конвертация медиаресурсов

source: debugging shaders
ru: отладка шейдеров

source: optimizing PNG files
ru: оптимизация PNG-файлов

source: `from EMSDK source code`_
ru: `из исходных текстов EMSDK`_

source: building Uranium
ru: сборка Uranium

source: debugging
ru: отладка

source: building the manual
ru: сборка документации

source: installed with PIP v3 (pip3 install sphinx-intl)
ru: устанавливается через PIP v3 (pip3 install sphinx-intl)

source: building the manual (internationalization)
ru: сборка документации (перевод)

source: building the manual (PDF version)
ru: сборка документации (PDF-версия)

source: installed with NPM (npm install -g jsdoc)
ru: устанавливается через NPM (npm install -g jsdoc)

source: building the API documentation
ru: сборка документации (документация на API)

source: `from PEG.js source code`_
ru: `из исходных текстов PEG.js`_

source: building shader preprocessor
ru: сборка препроцессора шейдеров

source: Naming Functions and Variables
ru: Названия функций и переменных

source: When creating new functions and variables it is recommended to use the following prefixes and suffixes.
ru: Рекомендуется при создании новых функций и переменных использовать следующие префиксы и суффиксы.

source: create an abstract object
ru: создание абстрактного объекта

source: create a certain object
ru: создание конкретного объекта

source: update the state of an existing object
ru: обновить состояние имеющегося объекта

source: add/remove a temporary object property
ru: добавить/удалить временное свойство к объекту

source: add/remove a temporary property to the already existing properties of the same kind
ru: добавить/удалить временное свойство к уже существующим подобного рода

source: add/remove an array element (accessed by index)
ru: добавить/удалить элемент массива (доступ по индексу места)

source: switch flag's binary value
ru: изменить значение бинарной величины/флага

source: operation with flags, binary values or arbitrary parameters
ru: операция с флагом, бинарной величиной или произвольным параметром

source: set/get the property/variable value
ru: установить/получить значение свойства/переменной

source: global variable - cache in the form of a simple object (array, vector)
ru: глобальная переменная - кеш в виде простого объекта (массив, вектор)

source: global variable - cache in the form of a complex object
ru: глобальная переменная - кеш в виде сложного объекта

source: Debugging
ru: Отладка

source: Engine debugging is performed with the ``debug.js`` module methods.
ru: Отладка движка производится с помощью методов модуля ``debug.js``.

source: The structure of the current render graph can be saved in the DOT format using the ``b4w.debug.scenegraph_to_dot()`` call, for example, in the browser console. After calling this method, save the console output into the file with the .gv extension. To get the graph in a visual form the `graphviz <http://www.graphviz.org/>`_ utilities are required. Converting to the SVG format is performed using the command:
ru: Структура текущего рендер-графа может быть сохранена в формате DOT с помощью вызова ``b4w.debug.scenegraph_to_dot()``, например, в консоли браузера. После вызова данного метода содержимое консоли сохранить в файл с расширением .gv. Чтобы получить граф в графическом виде, необходим набор утилит `graphviz <http://www.graphviz.org/>`_. Преобразование в формат SVG выполняется с помощью вызова:

source: where ``graph.gv`` is the name of the file with the saved graph.
ru: где ``graph.gv`` имя файла с сохранённым графом.

source: Shader Compilation
ru: Компиляция шейдеров

source: All shaders used in the engine are processed by a compiler. The compiler performs the following three main procedures:
ru: Используемые в движке шейдеры подвергаются обработке компилятором. Kомпилятор выполняет 3 основных процедуры:

source: validation of the shader code,
ru: валидацию кода шейдеров,

source: its obfuscation and
ru: обфускацию кода шейдеров,

source: optimization.
ru: оптимизацию кода шейдеров.

source: In order to run the compiler, execute one of the following commands in the SDK root:
ru: Для запуска компиляции требуется выполнить одну из команд в корневой директории SDK:

source: **make** *compile_shaders* - performs validation, obfuscation, optimization and finally, export of the compiled shaders,
ru: **make** *compile_shaders* - проверка, обфускация, оптимизация и экспорт скомпилированных шейдеров,

source: **make** *verify_shaders* - performs only validation, obfuscation and optimization.
ru: **make** *verify_shaders* - проверка, обфускация и оптимизация.

source: Syntax analysis (parsing) of the shader text is first performed during compilation. The corresponding parser is created automatically based on the grammar, using the `PEG.js <http://pegjs.majda.cz/>`_ generator. Then the shaders are validated, obfuscated and optimized according to the parser data, and after that the shaders are exported in the form of an abstract syntax tree (AST) for direct loading in the engine.
ru: В процессе компиляции сначала осуществляется синтаксический анализ (парсинг) текста шейдера. Соответствующий парсер создается автоматически на основе грамматики с помощью генератора `PEG.js <http://pegjs.majda.cz/>`_. Далее по данным парсинга производится валидация, обфускация и оптимизация шейдеров, после чего шейдеры экспортируются в виде абстрактного синтаксического дерева (Abstract Syntax Tree, AST) для непосредственной загрузки движком.

source: The location of the main files in the repository:
ru: Расположение основных файлов в репозитории:

source: initial grammar - glsl_utils/pegjs/glsl_parser.pegjs
ru: исходная грамматика - glsl_utils/pegjs/glsl_parser.pegjs

source: parser generation script - glsl_utils/pegjs/gen_nodejs.sh
ru: скрипт генерации парсера - glsl_utils/pegjs/gen_nodejs.sh

source: parser - glsl_utils/compiler/glsl_parser.js
ru: парсер - glsl_utils/compiler/glsl_parser.js

source: Validation
ru: Валидация

source: The compiler performs the following procedures related to shader code validation:
ru: Компилятор шейдеров выполняет следующие процедуры, связанные с проверкой кода:

source: reporting about unused variables and functions (dead code),
ru: вывод сообщений о неиспользуемых переменных и функциях (dead code),

source: checking the syntax of shaders,
ru: проверка синтаксиса шейдеров,

source: checking the conformance of shaders to the import/export mechanism,
ru: проверка шейдеров на соответствие import/export-механизма,

source: removing odd or repetitive tokens: spaces, line ends and semicolons.
ru: удаление лишних пробелов, переводов строк и повторяющихся символов ";".

source: Obfuscation
ru: Обфускация

source: Obfuscation minifies the GLSL code and makes it difficult to understand it. So far the following procedure is implemented:
ru: Обфускация служит для сокращения объема и затруднения понимания GLSL-кода. На данный момент в нем реализована следующая процедура:

source: replacing the user-defined identifiers with shorter single-symbol, two-symbol etc. names (with support of the import/export mechanism).
ru: замена пользовательских идентификаторов более короткими односимвольными, двухсимвольными и т.д. именами (с поддержкой import/export-механизма).

source: Optimization
ru: Оптимизация

source: Optimization constitutes the following procedures:
ru: Оптимизация заключается в выполнении следующих процедур:

source: removing curly brackets which are not useful in any ways except creating local scopes (this functionality is used for processing node/lamp directives),
ru: удаление фигурных скобок, которые не несут функциональной нагрузки, но порождают новые области видимости (данный функционал полезен при обработке директив node/lamp),

source: optimization inside functions - creating shared local variables to replace ones originally created by the programmer.
ru: внутрифункциональная оптимизация, связанная с использованием малого числа буферных локальных переменных взамен локальных переменных, заданных программистом.

source: An example of removing unused curly brackets: replacing the following code
ru: Примером удаления бесполезных фигурных скобок может служить замена кода

source: with this code
ru: следующим кодом

source: Low number of temporary local variables is achieved by repetitively using them in different contexts. For example, the following code
ru: Использование малого числа буферных локальных переменных заключается в том, что они повторно используются в разных контекстах. Например, следующий код

source: will be replaced with
ru: будет заменен на

source: Local variables for structures and arrays are not optimized this way.
ru: Не производится оптимизация локальных переменных структур и переменных массивов.

source: Import/Export Directives
ru: Директивы import/export

source: import/export directives are used to organize, structure and increase the readability of the shader code in the include file. They are specified in the beginning of the file and should look approximately like this:
ru: В целях упорядочивания, структурирования и повышения удобочитаемости кода шейдеров в include-файлах используются директивы import и export. Они указываются в начале файла и должны выглядеть примерно следующим образом:

source: The ``#import`` directive defines a set of ids which are declared outside the include file but can be accessed from inside it. There is a limitation though: such ids must necessarily be declared somewhere above the place where the include file is linked.
ru: Директива ``#import`` определяет набор идентификаторов, которые объявлены вне этого include-файла, но доступны для использования в нем. Имеется ограничение: такие идентификаторы должны быть обязательно объявлены где-либо выше места подключения include-файла.

source: The ``#export`` directive defines a set of ids which can be accessed from outside this file. Such ids must necessarily be declared in this file.
ru: Директива ``#export`` определяет набор идентификаторов, доступных для использования вне данного файла. Такие идентификаторы должны быть обязательно объявлены в этом файле.

source: Therefore, the shader which uses the include file must have all the declarations necessary for import before the place of linking, and can use the exported ids after it.
ru: Таким образом, шейдер, использующий include-файл, обязан до места подключения содержать объявления, необходимые для импорта, а после него может использовать экспортируемые идентификаторы.

source: Ids can be both variable names and function names. If there are no import/export directives it's considered by default that the include file does not use external declarations and does not allow the using of internal ones.
ru: Идентификаторами могут быть как имена переменных, так и имена функций. По умолчанию при отсутствии директив import/export считается, что include-файл не использует внешние объявления и не предоставляет пользование внутренними.

source: Recommendations and Limitations
ru: Рекомендации и ограничения

source: Because of the following reasons: preprocessing, the need to process multiple shaders and include files and due to the compiler's features - its possible to guarantee the work of the output code only if a number of rules and limitations are respected with regard to the shader source code:
ru: В связи с наличием препроцессинга, необходимостью совместной обработки нескольких шейдеров и include-файлов, а также особенностями реализации компилятора гарантировать работоспособность полученного на выходе кода можно только при соблюдении ряда правил или ограничений на текст исходных шейдеров:

source: In order to describe constants which are defined by the engine at run, it's necessary to use the ``#var`` special directive. For example:
ru: Обязательное использование специальной директивы ``#var`` для описания констант, определяемых движком в момент запуска. Например:

source: The syntax here is similar to the #define directive. The point of the #var directive is that the value which it defines allows to parse the initial shader. It's irrelevant what exactly it will be (e.g. 'uniform' or 'attribute' in the above example), because at this level it's unknown anyway. Nevertheless, it's better to specify a more or less suitable description and not something arbitrary.
ru: Синтаксис здесь схож с директивой #define. Смысл директивы #var в том, чтобы определяемое ею значение позволило распарсить исходный шейдер. Что это будет конкретно (например, 'uniform' или 'attribute' в примере выше), не важно, т.к. на этом этапе оно все равно неизвестно. Однако, желательно указывать более-менее подходящее описание, а не что-то совершенно произвольное.

source: The #var directive is not necessary for constants used not in the shader code but in the preprocessor expressions.
ru: Для констант, используемых не в коде шейдера, а в выражениях препроцессинга, директива ``#var`` не обязательна.

source: Using the import/export directives when needed.
ru: Использование при необходимости директив import/export.

source: The built-in functions must not be overloaded - only the user ones.
ru: Не следует перегружать встроенные функции, только пользовательские.

source: Variables should not be declared with names of the built-in functions, or main (even if it doesn't lead to errors).
ru: Не следует объявлять переменные с именем одной из встроенных функций, либо main (даже если это не приводит к ошибке).

source: The #var and #define directives must not be used for replacing single symbols in such operators as: "++", "--", "\*=", "/=", "+=", "-=", "==", "<=", ">=", "!=", "&&", "||", "^^".
ru: Нельзя использовать директивы #var и #define для замены отдельных символов в таких операторах, как: "++", "--", "\*=", "/=", "+=", "-=", "==", "<=", ">=", "!=", "&&", "||", "^^".

source: For example:
ru: Например:

source: The usage of the #include directive should not lead to ambiguity during the obfuscation of the include file. This can happen when multiple shaders are included into the same file and the above defined directives (like #var or #define) can have influence on any of them. Also, it's better not to use undeclared functions and variables in the include file.
ru: Использование директивы #include, не должно приводить к неоднозначности при обфускации содержимого include-файла. Это может произойти в том случае, когда один и тот же файл включается в несколько разных шейдеров, и в каком-то из них могут повлиять определенные выше директивы, вроде #var или #define. Также не стоит использовать в include-файле необъявленные функции и переменные.

source: Multi-level includes or multiple inclusion of the same include into the same shader is not supported.
ru: Использование вложенных include'ов или множественного включения одного и того же include'a в один и тот же шейдер не поддерживается.

source: Shader malfunction can also be caused by nontrivial using of preprocessing, for example, creating an invalid GLSL code:
ru: К неработоспособности шейдера может привести нетривиальное использование препроцессинга, например, создающее невалидный GLSL-код:

source: Do not declare variables with such names as ``node_[NODE_NAME]_var_[IN_OUT_NODE]``, where ``NODE_NAME`` --- name of some node, ``IN_OUT_NODE`` --- name of an input or an output of the node.
ru: Не следует объявлять переменные с именами вида ``node_[NODE_NAME]_var_[IN_OUT_NODE]``, где ``NODE_NAME`` --- название некоторой ноды, ``IN_OUT_NODE`` --- название одного из входов или выходов ноды.

source: Repetitive use of ``#nodes_main``, ``#nodes_global`` or ``#lamps_main`` directives is not permitted inside a single shader.
ru: Не разрешается множественное использование одной и той же директивы ``#nodes_main``, ``#nodes_global`` или ``#lamps_main`` в одном шейдере.

source: The ``#nodes_main``, ``#nodes_global`` and ``#lamps_main`` directives are recommended to use in the file, containing these shader nodes description, for example, in the same include-file. This is necessary for the correct shader validation.
ru: Директивы ``#nodes_main``, ``#nodes_global`` и ``#lamps_main`` рекомендуется использовать в том же файле, в котором содержится описание шейдерных нод, например, в одном и том же include-файле - это необходимо для корректной валидации шейдеров.

source: WebGL Extensions
ru: Расширения WebGL

source: Compilation may depend on WebGL extensions being used if they somehow influence the shading language. At the moment the following extensions are supported by the compiler:
ru: Работа обфускатора может зависеть от используемых WebGL-расширений, если они каким-либо образом влияют на шейдерный язык. На данный момент поддерживаются следующие расширения:

source: Compilation Errors
ru: Ошибки компилятора

source: In case of an error the compiler will output the corresponding message in the console.
ru: В случае ошибки компилятор выведет соответствующее сообщение в консоли.

source: Table of possible errors:
ru: Перечень возможных ошибок:

source: Error message
ru: Сообщение об ошибке

source: Cause
ru: Причина

source: Ambiguous obfuscation in the 'FILE_NAME' include file.
ru: Ошибка! Неоднозначная обфускация include-файла FILE_NAME.

source: The NAME WebGL extension used in the FILE_NAME file is not supported by the obfuscator.
ru: Ошибка! WebGL-расширение с именем NAME, использованное в файле FILE_NAME, не поддерживается обфускатором.

source: The FILE_NAME include file could not be found.
ru: Ошибка! При подключении не найден include-файл FILE_NAME.

source: Error in FILE_NAME file. Undeclared identifier NAME of type TYPE (variable, function, structure etc).
ru: Ошибка в файле FILE_NAME. Необъявленный идентификатор типа TYPE (переменная, функция, структура, ...) с именем NAME.

source: Undeclared identifier NAME of type TYPE (variable, function, structure etc). Declaration missing for the identifier required in the FILE_NAME include file according to the ``#import`` directive.
ru: Ошибка! Необъявленный идентификатор типа TYPE (переменная, функция, структура, ... ) с именем NAME. Отсутствует объявление идентификатора, требуемого в include-файле FILE_NAME согласно директиве ``#import``.
