Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/developers_advanced.po
Languages: ru

source: Error in FILE_NAME file. Undeclared identifier NAME of type TYPE (variable, function, structure etc). Possibly its export into the INCLUDE_NAME include file should be allowed.
ru: Ошибка в файле FILE_NAME. Необъявленный идентификатор типа TYPE (переменная, функция, структура, ...) с именем NAME. Возможно требуется разрешить его экспорт в include-файле INCLUDE_NAME.

source: Undeclared identifier NAME of type TYPE (variable, function, structure etc). Possibly it should be specified as imported in the FILE_NAME include file.
ru: Ошибка! Необъявленный идентификатор типа TYPE (переменная, функция, структура, ... ) с именем NAME. Возможно требуется указать его как импортируемый в include-файле FILE_NAME.

source: Undeclared identifier NAME is allowed for export in the FILE_NAME include file.
ru: Ошибка! В include-файле FILE_NAME разрешен для экспорта необъявленный идентификатор с именем NAME.

source: Error in FILE_NAME file. A reserved id is used for declaring the identifier NAME of type TYPE (variable, function, structure etc).
ru: Ошибка в файле FILE_NAME. Использование зарезервированного слова при объявлении идентификатора типа TYPE (переменная, функция, структура, ...) с именем NAME.

source: The ``#extension`` directive specified for ``all`` WebGL extensions in the FILE_NAME file does not support the behavior BEHAVIOR_TYPE.
ru: Ошибка! Директива ``#extension``, указанная для всех (``all``) WebGL-расширений в файле FILE_NAME, не поддерживает поведение BEHAVIOR_TYPE.

source: Syntax error in line LINE_NUMBER column COL_NUMBER during parsing the FILE_NAME shader. The initial error description is quoted in the ERROR_MESSAGE. The code listing taken from around the corresponding line is attached to the message (note the peculiarity of pegjs parser which specify the line which is a little bit after the actual error.
ru: Ошибка синтаксиса в строке LINE_NUMBER, столбце COL_NUMBER при парсинге шейдера FILE_NAME. Исходное описание ошибки приведено в ERROR_MESSAGE. В сообщении прилагается листинг кода в окрестности соответствующей строки (следует учитывать особенность pegjs-парсеров, указывающих чуть далее места, вызвавшего ошибку).

source: An unused function NAME is declared in the FILE_NAME file.
ru: В файле FILE_NAME объявлена функция NAME, которая нигде не используется.

source: The FILE_NAME include file is not used in any of the shaders and so it will be excluded from the obfuscated version.
ru: Include-файл FILE_NAME не используется ни в одном из шейдеров, поэтому будет исключен из закомпиленной версии.

source: An unused id NAME is imported in the FILE_NAME include file.
ru: Идентификатор с именем NAME импортируется в include-файле FILE_NAME, но нигде не используется.

source: An unused variable NAME is declared in the FILE_NAME file.
ru: В файле FILE_NAME объявлена переменная NAME, которая нигде не используется.

source: Updating Add-on Translations
ru: Обновление переводов аддона

source: If you need to update all existing .po files, run the script *translator.py* in the SDK/scripts directory without arguments:
ru: При необходимости обновить все существующие .po файлы, запустите скрипт *translator.py* из директории SDK/scripts без параметра:

source: In order to update an existing .po file, run the script with a supported language code as an argument:
ru: Для обновления существующего .po файла необходимо вызвать скрипт с передачей ему одного из поддерживаемых языков:

source: In order to view the list of supported languages, run the script as follows:
ru: Для просмотра списка поддерживаемых языков вызовите скрипт следующим образом:

source: In any case, the file *empty.po* will be updated upon running the script.
ru: При вызове скрипта в любом случае будет обновлен файл *empty.po*.

source: After updates, the .po files can be edited/translated as usual.
ru: После обновления .po файлы могут быть отредактированы/переведены.

source: validation
ru: валидация

source: obfuscation
ru: обфускация

source: optimization
ru: оптимизация

source: import/export directives
ru: директивы import/export

source: recommendations and limitations
ru: рекомендации и ограничения

source: errors
ru: ошибки
