Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/git_short_manual.po
Languages: ru

source: Team Work. Using Git
ru: Работа в команде с использованием Git

source: Table of Contents
ru: Содержание

source: Overview
ru: Общие сведения

source: In order to organize team work a Git version control system can be used. Using Git has a number of benefits as compared with other ways to collaborate:
ru: Для организации командной работы над проектом может быть использована система контроля версий файлов Git. Использование Git имеет ряд преимуществ перед другими способами организации совместной работы:

source: saving the history of changes with the possibility to roll back to previous versions
ru: сохранение полной истории изменений файлов с возможностью возврата к предыдущим версиям

source: synchronizing changes between users and automatic merging of changes
ru: синхронизация изменений между пользователями и автоматическое слияние изменений

source: working with large binary files is possible
ru: возможность работы с бинарными файлами большого объёма

source: Git is a distributed system and every developer or designer has his own local repository (storage). Syncing between the local repositories can be performed via the central ("shared") storage, which can be located on a dedicated machine (server). Access to the server can be organized through SSH protocol.
ru: Git - распределенная система, и каждый разработчик или дизайнер имеет собственный локальный репозиторий (хранилище). Синхронизация между локальными репозиториями может осуществляться через центральное "общее" хранилище, которое можно разместить на специально выделенной для этой цели машине (сервере). К серверу может быть организован доступ по протоколу SSH.

source: Although there are many GUIs for Git beginners, here the work with the ``git`` standard console utility is explained.
ru: Хотя для Git существует множество графических утилит, упрощающих работу начинающих пользователей, здесь мы рассмотрим работу со штатной консольной утилитой, вызываемой командой ``git``.

source: Typical Workflow
ru: Типичный рабочий процесс

source: Files can be created, added or deleted during the work process in the local repositories.
ru: В ходе работы в локальных репозиториях создаются, изменяются или удаляются файлы.

source: After a certain logical period of work is finished it is necessary to fix (commit) the changes and/or synchronize with your team mates.
ru: По завершении некоторого логического этапа работы возникает необходимость фиксации изменений (коммит) и/или синхронизации с коллегами.

source: Files are prepared for commit i.e. the accounting of changed, new and deleted files and also the resetting of changes.
ru: Проводится подготовка файлов к коммиту - учет измененных, новых и удаленных файлов, а также сброс изменений.

source: Commit is performed.
ru: Осуществляется коммит.

source: Local changes are uploaded into the shared storage and become available for the colleagues.
ru: Локальные изменения загружаются в общее хранилище и становятся доступными для коллег.

source: A limited set of Git commands recommended for authoring applications and their graphical resources is described below.
ru: Далее описывается ограниченный набор команд Git, рекомендуемых к использованию при создании приложений и графических ресурсов.

source: It's necessary to switch to the repository before executing the commands, e.g.:
ru: Перед выполнением команд необходимо перейти в репозиторий, например:

source: Individual Settings
ru: Индивидуальные настройки

source: A new user can set up his name and email using the commands:
ru: Новый пользователь может установить имя и почтовый адрес командами:

source: The set up data will be used in the changelog.
ru: Установленные данные будут использоваться в логе изменений.

source: Checking the Status
ru: Проверка статуса

source: It's recommended to check the state of the repository before, in progress and after performing all the operations.
ru: Перед началом, в процессе или после выполнения любых операций рекомендуется проверять текущее состояние репозитория.

source: Use this command to check the status:
ru: Проверить статус можно командой:

source: The result of the ``git status`` command if all the commits were performed and there are no new files:
ru: Результат команды ``git status``, если все коммиты проведены и нет новых файлов:

source: Possible result of ``git status`` if there are changes. For example the :file:`apps_dev/firstperson/firstperson.js` and :file:`doc_src/git_short_manual.rst` files are changed and a new file :file:`123.txt` is created:
ru: Возможный результат команды ``git status``, если имеются изменения. Например, файлы :file:`apps_dev/firstperson/firstperson.js` и :file:`doc_src/git_short_manual.rst` изменены, и создан новый файл :file:`123.txt`:

source: Before the Commit
ru: Перед коммитом

source: Checking changes (of the text files)
ru: Проверка изменений (текстовых файлов)

source: In case of text files it is recommended to view the introduced changes before performing the commit.
ru: Перед совершением коммита в случае текстовых файлов рекомендуется просмотреть внесенные изменения.

source: Check what was changed in the whole directory:
ru: Проверить, что изменилось, во всей директории:

source: or in a specific file only:
ru: или только в определенном файле:

source: A possible result of the ``git diff`` command for a text file:
ru: Возможный результат команды ``git diff`` для текстового файла:

source: Rolling back files
ru: Восстановление файлов

source: If the file was changed or deleted but it is necessary to recover it (to the latest committed state) use the command:
ru: Если файл был изменен или удален, но его необходимо восстановить (до состояния, зафиксированного последним коммитом), следует использовать команду:

source: The introduced changes will be canceled - this is why this command should be performed with caution.
ru: Внесенные изменения будут отменены, поэтому эту команду необходимо выполнять с осторожностью.

source: Unwanted files
ru: Посторонние файлы

source: If a file is listed in the ``Untracked files`` (``git status``), but version control is not needed for it, it should be deleted or moved beyond the working directory.
ru: Если файл значится в списке ``Untracked files`` (команда ``git status``), но контроль версий для него не нужен, его следует удалить или переместить за пределы рабочей директории.

source: Preparing for Commit
ru: Подготовка к коммиту

source: Adding files
ru: Добавление файлов

source: If you are happy with the changes, add the needed changed and/or new files for commit.
ru: Если изменения устраивают, добавить нужные измененные и/или новые файлы для коммита:

source: Check the status again:
ru: Снова проверить статус:

source: Possible result of the ``git status`` command after adding some files with the ``git add`` command:
ru: Возможный результат команды ``git status`` после добавления некоторых файлов командой ``git add``:

source: You can see that the :file:`apps_dev/firstperson/firstperson.js` and :file:`123.txt` files were added for commit and the :file:`doc_src/git_short_manual.rst` file was not added. To make things easier it is recommended to either add such files for commit or cancel their changes with the ``git checkout`` command.
ru: Видно, что для коммита добавлены файлы :file:`apps_dev/firstperson/firstperson.js` и :file:`123.txt`, а файл :file:`doc_src/git_short_manual.rst` остался недобавленным. Для упрощения работы рекомендуется либо добавлять такие файлы для коммита, либо отбрасывать их изменения командой ``git checkout``.

source: Removing files
ru: Удаление файлов

source: Some files can be marked as deleted from Git after performing the ``git status`` command, for example:
ru: Некоторые файлы могут быть отмечены как удаленные из Git после выполнения команды ``git status``, например:

source: In this case if deleting the file should be recorded (i.e. enter the commit), perform the ``git rm`` command, for example:
ru: В таком случае, если удаление файла должно быть зафиксировано (т.е. войти в коммит), выполнить команду ``git rm``, например:

source: If the file was deleted by accident and its necessary to recover it, use the ``git checkout`` command.
ru: Если же файл был удален по ошибке, и его необходимо вернуть, нужно использовать команду ``git checkout``.

source: Commit
ru: Коммит

source: Perform commit with the command:
ru: Выполнить коммит командой:

source: A text editor window will show up (for example, **nano** or **vim**), in which it's necessary to enter the commit comment in English.
ru: Появится окно текстового редактора (например, **nano** или **vim**), в котором нужно ввести комментарий к коммиту на английском языке.

source: Save the changes and quit the editor (in **nano** Ctrl+O, then Ctrl+X; in **vim** ZZ, or ESC :wq).
ru: Сохранить изменения и выйти из редактора (в **nano** Ctrl+O, затем Ctrl+X; в **vim** ZZ, или ESC :wq).

source: After commit it's recommended to recheck the status. Commit is performed correctly if the ``git status`` command returns ``nothing to commit, working directory clean``.
ru: После совершения коммита рекомендуется снова проверить статус. Коммит совершен правильно, если команда ``git status`` отображает ``nothing to commit, working directory clean``.

source: Syncing Between Repositories
ru: Синхронизация между репозиториями

source: From the remote - to the local
ru: Из удаленного - в локальный

source: After all the commits are performed it's necessary to load the changes from the remote ("shared") repository to the local one:
ru: После того как все коммиты сделаны, необходимо загрузить изменения из удаленного ("общего") репозитория в локальный:

source: Result of the ``git pull`` command if there are no changes in the remote repository:
ru: Результат команды ``git pull``, если в удаленном репозитории нет изменений:

source: Result of the ``git pull`` command if the remote repository contains changes and syncing was successful:
ru: Результат команды ``git pull``, если в удаленном репозитории были изменения, и синхронизация прошла успешно:

source: If you wish it's possible to look up the changes made by your colleagues using the following command:
ru: При желании можно посмотреть, какие изменения были внесены коллегами, командой:

source: The parameter of this command - in this case dbf3877..9f9700c - shows between which commits exactly the changes were made. This parameter can be conveniently selected in the console in the ``git pull`` results and pasted with a mouse click (middle button) where you need.
ru: Параметр этой команды - в данном случае dbf3877..9f9700c - указывает, между какими именно коммитами просматриваются изменения. Этот параметр удобно выделить в результатах команды ``git pull`` и вставить щелчком мыши (средняя кнопка) в консоли в нужном месте.

source: You can also view the changelog:
ru: Также можно просмотреть лог изменений:

source: The ``git pull`` command does not always lead to a successful synchronization. The result of ``git pull`` when there are conflicts:
ru: Команда ``git pull`` не всегда приводит к успешной синхронизации. Результат команды ``git pull`` в случае наличия конфликтов:

source: The steps to be taken at conflicts are described below.
ru: Порядок действий при возникновении конфликтов описан далее.

source: From the local - to the remote
ru: Из локального - в удаленный

source: After that the changes should be uploaded from the local repository to the remote ("shared") one to make the changes available for team mates.
ru: Затем нужно загрузить изменения из локального репозитория в удаленный ("общий"), чтобы локальные изменения стали доступными для коллег.

source: The result of the ``git push`` command if the remote repository already contains all the local changes:
ru: Результат команды ``git push``, если в удаленном репозитории уже есть все локальные изменения:

source: The result of the ``git push`` command if synchronization was successful:
ru: Результат команды ``git push``, если синхронизация прошла успешно:

source: The result of the ``git push`` command if synchronization was not successful because the ``git pull`` command was not executed first:
ru: Результат команды ``git push``, если синхронизация не прошла, потому что сначала не была выполнена команда ``git pull``:

source: You should execute the ``git pull`` command.
ru: Необходимо выполнить команду ``git pull``.

source: The changes uploaded into the central repository can be received by other developers with the ``git pull`` command.
ru: Изменения, загруженные в центральный репозиторий, могут быть получены другими участниками разработки с помощью команды ``git pull``.

source: Resolving Conflicts
ru: Разрешение конфликтов

source: Synchronization conflicts occur if both conditions are met
ru: Конфликты синхронизации происходят, если выполнены оба условия

source: the same file was changed both in the local and remote repositories, and
ru: один и тот же файл был изменен как в локальном, так и в удаленном репозитории, и

source: automatic merging of the changes didn't occur because the changes are in the same place of the file.
ru: автоматическое слияние изменений не произошло, поскольку изменения находятся в одном и том же месте файла.

source: Typical cases:
ru: Типичные случаи:

source: a binary file (texture, blend file) was independently changed by two developers
ru: бинарный файл (текстура, blend-файл) независимо изменен двумя участниками разработки

source: different changes were introduced to the same line of the same text file
ru: в текстовой файл в одной и той же строке были внесены разные изменения

source: one developer has changed the file while the other has moved it and so on.
ru: один участник разработки изменил файл, а другой - переместил его и т.п.

source: Although synchronization conflicts are normal, if they happen too often it slows down the work. It is recommended to notify your team mates about start of working with the shared binary files, and also to perform synchronization more often. It is necessary to effectively distribute the work between developers to reduce the number of such shared files. This can be achieved particularly through linking of all the scene's resources from the separate blend files into the master file.
ru: Хотя конфликты синхронизации - нормальное явление, слишком частое их возникновение замедляет работу. Рекомендуется ставить коллег в известность о начале работ с общими бинарными файлами, а также чаще проводить синхронизацию. Необходимо эффективно распределять работу между участниками разработки, чтобы таких общих файлов было как можно меньше. Этого можно добиться, в частности, подключением всех ресурсов сцены (linking) из отдельных blend-файлов в один мастер-файл.

source: The steps to be taken
ru: Порядок действий

source: It's not recommended to perform any files operations (modifying, deleting) while the repository is in a conflict state.
ru: Не рекомендуется производить какие-либо действия с файлами (изменять, удалять), пока репозиторий находится в конфликтном состоянии.

source: The first thing to do is to perform the ``git status`` command.
ru: Первое что необходимо сделать - выполнить команду ``git status``.

source: A list of conflicting files can be found in the ``Unmerged paths`` section.
ru: Список конфликтующих файлов отображен в разделе ``Unmerged paths``.

source: The order of the following steps is different for binary and text files.
ru: Дальнейший порядок действий различен для бинарных и текстовых файлов.

source: Binary files
ru: Бинарные файлы

source: At this stage the conflicting binary files are in the same state as they were in the local repository before the synchronization attempt. The files are fully functional (for example they can be opened by graphics editors).
ru: На данном этапе конфликтующие бинарные файлы находятся в том состоянии, в котором они находились в локальном репозитории до попытки синхронизации. Файлы полностью функциональны (например, открываются графическими редакторами).

source: In case of conflicting binary files it's necessary to sort out (with the team mates or by yourself) which of the files should be left and which should be discarded. Selecting can be performed with the ``git checkout`` command.
ru: В случае конфликта бинарных файлов необходимо выяснить с коллегами или самостоятельно, какую из версий оставить, а какую отбросить. Выбор осуществляется командой ``git checkout``.

source: Select the local version of the file (**- -ours**). To make sure that it's local you can open it.
ru: Выбрать локальную версию файла (**- -ours**). Его можно открыть и убедиться в этом.

source: Select the remote version of the file (**- -theirs**). To make sure that it's remote you can open it.
ru: Выбрать удаленную версию файла (**- -theirs**). Его можно открыть и убедиться в этом.

source: Select the local version of the file again (**- -ours**).
ru: Снова выбрать локальную версию файла (**- -ours**).

source: Eventually you have to stick to the right version of the file. In case there is a threat of losing the work you may save the discarded file outside the repository.
ru: В итоге необходимо остановиться на нужной версии файла. При угрозе потери работы можно сохранить отбрасываемую версию файла вне репозитория.

source: Text files
ru: Текстовые файлы

source: At this stage Git introduces both local and remote changes to the conflicting text files, in a special format. Such text files are not workable as a rule
ru: На данном этапе в конфликтующие текстовые файлы Git'ом вносятся как локальные, так и удаленные изменения одновременно, в особом формате. Такие текстовые файлы как правило, не работоспособны.

source: Example. One developer changed the scene name from "Blue Lizard" to "Green Lizard" in the application file and uploaded the changes into the central repository. Another developer changed "Blue Lizard" to "Red Lizard" in the same line, performed commit and executed the ``git pull`` command. As a result this very developer will be responsible for resolving the conflict. The following lines will be present in his version of the application file:
ru: Пример. Один участник разработки изменил имя сцены с "Blue Lizard" на "Green Lizard" в файле приложения и загрузил изменения в центральный репозиторий. Другой участник разработки изменил в той же строке "Blue Lizard" на "Red Lizard", совершил коммит и выполнил команду ``git pull``. В результате именно на этого участника ложится ответственность по разрешению конфликта. В его файле приложения будут находиться строки:

source: In case of conflicting text files the following steps can be taken. Files with source code should be edited with or without respect to the changes introduced by both parties. On the other hand, it is easier to reexport the exported scene text files (ending with **.json**).
ru: В случае конфликта текстовых файлов можно поступить следующим образом. Файлы, содержащие исходный код, необходимо отредактировать с учетом или без учета внесенных обеими сторонами изменений. В то же время экспортированные текстовые файлы сцен (заканчивающиеся на **.json**) проще повторно экспортировать.

source: Correcting commit
ru: Корректирующий коммит

source: After selecting the required files or editing the changes, add them for commit:
ru: После выбора нужных файлов или редактирования изменений, добавить их для коммита:

source: Possible result of ``git status`` command after adding the conflicting files for commit:
ru: Возможный результат выполнения ``git status`` после добавления конфликтующих файлов для коммита:

source: Perform commit. It is recommended to leave the default comment:
ru: Выполнить коммит, комментарий рекомендуется оставить предложенный по умолчанию:

source: Conflicts are resolved, the changes from the remote repository are successfully applied in the local repository. Now the changes in the local repository - including the just resolved conflict - can be uploaded to the remote repository with the ``git push`` command.
ru: Конфликты разрешены, изменения из удаленного репозитория успешно применены в локальном репозитории. Теперь изменения в локальном репозитории, - включающие только что разрешенный конфликт, - можно загрузить в удаленный репозиторий командой ``git push``.

source: Tags
ru: Тэги

source: Tags are intended for pointing at a certain commit, for example, to specify a stable product version.
ru: Тэги (метки) предназначены для указания на определенный коммит, например, с целью обозначения стабилизированной версии продукта.

source: View the list of tags:
ru: Просмотреть список тэгов:

source: Create a tag for the release from June 3, 2013, pointing to the commit with a stable product version:
ru: Создать тэг для релиза от 3 июня 2013 г., указывающий на коммит со стабильной версией проекта:

source: Check the commit tag information:
ru: Просмотреть информацию о коммите тэга:

source: Roll back to the tag...
ru: Перейти к тэгу...

source: ...and return:
ru: ...и вернуться:

source: Synchronize the tags with the remote repository:
ru: Синхронизировать тэги с удаленным репозиторием:

source: Delete the tag (if created by mistake):
ru: Удалить тэг (при ошибочном создании):

source: Other Useful Commands
ru: Другие полезные команды

source: Check the log for January, 2012, show file names without merging commits:
ru: Просмотреть лог за январь 2012 г, показывать имена файлов, без коммитов слияния:

source: individual settings
ru: индивидуальные настройки

source: checking the status
ru: проверка статуса

source: preparing for commit
ru: подготовка к коммиту

source: adding and removing files
ru: добавление и удаление файлов

source: commit
ru: коммит

source: synchronization between repositories
ru: синхронизация между репозиториями

source: resolving conflicts
ru: разрешение конфликтов

source: tags
ru: тэги
