Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/outdoor_rendering.po
Languages: ru

source: Angle amplitude of the “detail” deviation caused by the influence of wind (in degrees). The default value is 0.1.
ru: Амплитуда угла "детализованного" отклонения под действием ветра (в градусах). Значение по умолчанию 0.1.

source: Angle amplitude of the branch deviation caused by the influence of wind (in degrees). The default value is 0.3.
ru: Амплитуда угла отклонения ветвей под действием ветра (в градусах). Значение по умолчанию 0.3.

source: Detail bending frequency. The default value is 1.0.
ru: Частота колебаний ветвей. Значение по умолчанию 1.0.

source: Text field for specifying the name of the vertex color layer which contains the information about the stiffness of leaves. Can be left empty.
ru: Текстовое поле для названия слоя вертексного цвета, содержащего информацию о жесткости листвы. Может быть оставлено пустым.

source: Text field for specifying the name of the vertex color layer which contains the information about the phase of leaves deviation. Can be left empty.
ru: Текстовое поле для названия слоя вертексного цвета, содержащего информацию о фазе отклонения листвы. Может быть оставлено пустым.

source: Text field for specifying the name of the vertex color layer which contains the information about the overall stiffness of leaves. Can be left empty.
ru: Текстовое поле для названия слоя вертексного цвета, содержащего информацию об общей жесткости листвы. Может быть оставлено пустым.

source: Vertex color layers should be present in the mesh if their names are specified.
ru: Слои вертексных цветов с указанными в настройках названиями должны существовать в меше.

source: shoreline data
ru: береговая линия

source: shoreline
ru: береговая линия
