Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/outdoor_rendering.po
Languages: ru

source: Outdoor Effects
ru: Природные эффекты

source: Table of Contents
ru: Содержание

source: Blend4Web has several environmental effects that can be useful for creating outdoor scenes.
ru: В Blend4Web присутствует ряд эффектов окружающей среды, которые могут быть полезны при создании открытых пространств.

source: Water
ru: Вода

source: Activation
ru: Активация

source: For the supposed water material activate the ``Water`` panel option under the ``Material`` tab.
ru: Для предполагаемого материала воды активировать панель ``Water`` во вкладке ``Material``.

source: Basic Settings
ru: Базовые настройки

source: *Transparency*
ru: *Прозрачность*

source: It is recommended to enable the gradient transparency (set the ``Transparency > Type`` parameter to the ``Alpha Blend`` value) and to tweak the ``Alpha`` value.
ru: Рекомендуется включить прозрачность с градиентом (установить значение ``Alpha Blend`` для параметра ``Transparency > Type``) и настроить значение ``Alpha``.

source: *Lighting parameters*
ru: *Параметры освещения*

source: Lighting parameters for the water material can be set up as described in the :ref:`material_lighting_params` section.
ru: Параметры освещения материала воды настраиваются как описано в разделе :ref:`material_lighting_params`.

source: Waves Dynamics
ru: Динамика волн

source: Ripples on the water are simulated by normal maps with animated UVs (from 0 up to 4 pieces). For normal map the only shared image is used - the textures differs only by the ``Mapping > Size`` parameters. The water mesh must have a UV layer.
ru: Рябь на водной поверхности симулируется при помощи карт нормалей с анимированными развертками (в количестве от 0 до 4). Для текстур - карт нормалей используется только одно общее изображение, текстуры различаются параметрами ``Mapping > Size``. Меш для воды должен иметь текстурную развертку.

source: Surface Wetting
ru: Смачивание поверхностей

source: Is carried out automatically. To turn the effect on activate the ``Wettable`` option on the needed materials ``Rendering Options`` panel.
ru: Осуществляется автоматически. Для включения эффекта на соответствующих материалах необходимо активировать опцию ``Wettable`` на панели ``Rendering Options``.

source: Reflection and Fresnel Effect
ru: Отражение и эффект Френеля

source: For the water material both static and dynamic reflection is supported as well as the Fresnel effect. See the :ref:`material_mirror` section.
ru: Для материала воды поддерживается как статическое, так и динамическое зеркальное отражение, с эффектом Френеля. См. раздел :ref:`material_mirror`.

source: Shoreline Smoothing
ru: Сглаживание у береговой линии

source: The effect affects the water near the shoreline - it becomes more transparent.
ru: Эффект заключается в том, что вода ближе к берегу становится прозрачнее.

source: Enable smoothing.
ru: Включить сглаживание.

source: This is the light absorption coefficient for water. The higher it is the more transparent the water is. This value can vary from 0 to 100. The default value is 6.
ru: Коэффициент поглощения света водой. Чем он выше, тем прозрачнее вода.Значение этого параметра может находиться в пределах от 0 до 100. Значение по умолчанию - 6.

source: Color Gradient
ru: Градиент цвета

source: For color gradient the water material must have a texture with the ``Export Options > Shore Distance Map`` option enabled. This texture can be generated using the script for :ref:`baking shoreline parameters <shore_distance_bake>`.
ru: Для создания цветного градиента на материале воды должна быть наложена текстура с включенной опцией ``Export Options > Shore Distance Map``, генерируемая с помощью скрипта для :ref:`запекания параметров береговой линии <shore_distance_bake>`.

source: This sets the color of shallow water. By default, blue (0.008, 0.222, 0.8) is used.
ru: Цвет воды на мелководье. По умолчанию используется синий (0.008, 0.222, 0.8) цвет.

source: This sets the mixing factor for the color of shallow water. This value can vary from 0 to 2, and is set to 1 by default.
ru: Коэффициент примешивания цвета воды на мелководье. Этот параметр может принимать значения от 0 до 2, значение по умолчанию - 1.

source: This determines the color of the water just at the shore line. By default, dark blue (0.003, 0.19, 0.57) is used.
ru: Цвет воды непосредственно у береговой линии. По умолчанию используется тёмно-синий (0.003, 0.19, 0.57) цвет.

source: This sets the mixing factor for the color of the water just near the shoreline. This value can vary from 0 to 2, and is set to 0.5 by default.
ru: Коэффициент примешивания цвета воды на береговой линии. Возможные значения - от 0 до 2, значение по умолчанию - 0.5.

source: Refraction
ru: Преломление

source: Under the ``Render`` tab in the ``Reflections and Refractions`` panel set the ``Refractions`` option to ``ON`` or ``AUTO``.
ru: Во вкладке ``Render`` в панели ``Reflections and Refractions`` выставить опцию ``Refractions`` в положение ``ON`` или ``AUTO``.

source: Foam
ru: Пена

source: For creating foam add a diffuse texture into the water material slot. Every RGB channel of this image must contain a BW foam texture in it. Then enable the ``Water Foam`` panel.
ru: Для создания пены необходимо добавить в текстурный слот материала воды диффузную текстуру, в каждом из RGB - каналов которой следует расположить черно-белые текстуры пены. Для полученной текстуры необходимо активировать панель ``Water Foam``.

source: Setting up the Textures
ru: Настройка текстур

source: Oscillation frequency of the animated UV coordinates. The default value is (1.0, 1.0).
ru: Частота колебаний анимированной развертки. Значение по умолчанию (1.0, 1.0).

source: Oscillation amplitude of the animated UV coordinates. The default value is (1.0, 1.0).
ru: Амплитуда колебаний анимированной развертки. Значение по умолчанию (1.0, 1.0).

source: Setting up the Material
ru: Настройка материала

source: General influence factor for the foam. The default value is 0.5.
ru: Фактор общего влияния пены. Значение по умолчанию 0.5.

source: Caustics and Chromatic Aberration
ru: Каустика и хроматическая аберрация

source: To create the caustics effect turn on the ``Caustics`` option on the water material. Also, there has to be at least one ``Sun`` on the scene.
ru: Для создания каустики на подводных объектах следует включить опцию ``Caustics``. Так же на сцене должен присутствовать источник освещение типа ``Sun``.

source: Cell size for the procedural texture. The default value is 0.25.
ru: Размер ячеек процедурной текстуры. Значение по умолчанию 0.25.

source: Caustics influence factor. The default value is 0.5.
ru: Фактор влияния каустики. Значение по умолчанию 0.5.

source: Underwater Environment
ru: Подводная среда

source: Visibility Settings (“fog”)
ru: Настройки видимости ("туман")

source: Fog color. The default value is (0.4, 0.6, 0.7).
ru: Цвет тумана. Значение по умолчанию (0.4, 0.6, 0.7).

source: Exponential factor which affects the density and visibility distance. The default value is 0.06.
ru: Экспоненциальный фактор, влияющий на плотность и расстояние. Значение по умолчанию 0.06.

source: The :ref:`god rays <god_rays>` effect settings are also applied.
ru: Применяются также настройки :ref:`сумеречных лучей <god_rays>`.

source: The ``Rendering Options > Backface Culling`` option must be turned off for the correct water surface rendering.
ru: Для корректного отображения водной поверхности необходимо выключить опцию ``Rendering Options > Backface Culling``.

source: Volumetric Waves
ru: Объемные волны

source: To enable procedural waves the ``Waves`` option must be turned on.
ru: Для создания объемных волн следует включить опцию ``Waves``.

source: The direction of procedural waves is derived from a ``Wind`` force field in the scene.
ru: Направление объёмных волн определяется силовым полем типа ``Wind``, присутствующим в сцене.

source: If a scene does not have a ``Wind`` force field, procedural waves will only move in the default direction which cannot be changed.
ru: Если в сцене отсутствует силовое поле типа ``Wind``, объёмные волны будут двигаться только в направлении, заданном по умолчанию. Это направление не может быть изменено.

source: Setting up
ru: Настройка

source: Wave height can vary from 0 to 5. The default value is 1.0.
ru: Высота волн. Возможные значения - от 0 до 5. Значение по умолчанию 0.0.

source: Wave length can vary from 0.01 to 200. The default value is 10.0.
ru: Длина волн. Возможные значения - от 0.01 до 200. Значение по умолчанию 10.0.

source: This is the size of the first component of the open water waves. This parameter can vary from 0 to 1. Default value is 0.05.
ru: Размер первого компонента волн, удаленных от берега. Этот параметр может принимать значения от 0 до 1. Значение по умолчанию - 0.05.

source: This is the size of the second component of the open water waves. This parameter can vary from 0 to 1. Default value is 0.03.
ru: Размер второго компонента волн, удаленных от берега. Возможные значения - от 0 до 1. Значение по умолчанию - 0.03.

source: This sets the frequency of the first component of the open water waves. This parameter can vary from 0 to 10. Default value is 1.3.
ru: Частота первого компонента волн, удалённых от берега. Этот параметр может принимать значения от 0 до 10. Значение по умолчанию - 1.3.

source: This sets the frequency of the second component of the open water waves. This parameter can vary from 0 to 10 and is set to 1 by default.
ru: Частота второго компонента волн, удаленных от берега. Возможные значения - от 0 до 10, значение по умолчанию - 1.

source: This is the minimum height decrease coefficient of the shore waves. This parameter can vary from 0 to 1 and is set to 0.4 by default.
ru: Минимальный коэффициент уменьшения высоты прибрежных волн. Диапазон значений - от 0 до 1, значение по умолчанию - 0.4.

source: This sets the frequency of the rolling of the shore waves. This parameter can vary from 0 to 10 and is set to 0.5 by default.
ru: Частота накатывания прибрежных волн. Значение этого параметра может изменяться от 0 до 10. Значение по умолчанию - 0.5.

source: This specifies the size of the noise for the shore waves. This parameter can vary from 0 to 1 and is set to 0.05 by default.
ru: Размер шума на прибрежных волнах. Возможные значения - от 0 до 1, значение по умолчанию - 0.05.

source: This describes the frequency of the noise for the shore waves. This parameter can vary from 0 to 1. Default value is 0.07.
ru: Частота шума на прибрежных волнах. Возможные значения - от 0 до 1. Значение по умолчанию - 0.07.

source: This is the noise minimum for the shore waves. This parameter can vary from 0 to 1. Default value is 0.5.
ru: Минимальное значение шума на прибрежных волнах. Этот параметр может принимать значения от 0 до 1. Значение по умолчанию - 0.5.

source: This sets the minimum coefficient of mixing open water waves. This parameter can vary from 0 to 1. Default value is 0.2.
ru: Минимальный коэффициент примешивания волн, удаленных от берега. Значение этого параметра может меняться от 0 до 1 и по умолчанию равно 0.2.

source: This coefficient shows how much the shore waves are shifted in the direction of the shoreline. This parameter can vary from 0 to 10. Default value is 5.
ru: Коэффициент смещения прибрежных волн в направлении к берегу. Этот параметр может принимать значения от 0 до 10 и равен 5 по умолчанию.

source: Settings for Surface Generation
ru: Настройки генерируемой поверхности

source: This enables a generated surface.
ru: Включить генерируемую поверхность.

source: This describes the number of cascades on the generated surface. This parameter's value can vary from 1 to 20. Default value is 5.
ru: Задаёт количество каскадов в генерируемой поверхности. Этот параметр может принимать значения от 1 до 20. Значение по умолчанию - 5.

source: This is the number of subdivisions in generated mesh. Default value is 64. The lowest possible value for this parameter is 2, while the highest possible value is 512.
ru: Количество подразделений в генерируемой поверхности. Значение по умолчанию - 64. Минимальное возможное значение для этого параметра - 2, а максимальное - 512.

source: This specifies the maximum distance from the camera to the edge of the last cascade. The value of this parameter can vary from 1 to 5000. Default value is 1000.
ru: Этот параметр задаёт максимальное расстояние от камеры до края последнего каскада. Значение параметра может меняться от 1 до 5000. Значение по умолчанию - 1000.

source: Baking Shoreline Data to Texture
ru: Создание текстуры с параметрами береговой линии

source: On the tools panel (hotkey “T”) under the ``Blend4Web`` tab open the ``Bake Shore Distance Map`` panel. Set the parameters: maximum distance to shore (``Maximum Distance``) and the resulting texture size (``Texture Size``). Select a landscape object (or multiple objects) first, and then - a water object. Click the ``Bake`` button.
ru: На панели инструментов (горячая клавиша "T") во вкладке ``Blend4Web`` открыть панель ``Bake Shore Distance Map``. Выставить настройки максимального расстояния до берега ``Maximum Distance`` и размера получаемой текстуры ``Texture Size``. Выбрать сначала объект (или несколько объектов) ландшафта, затем объект воды. Нажать кнопку ``Bake``.

source: Depending on the texture size and the number of vertices in the processed meshes the execution time of the script may vary from a fraction of a second up to several minutes. Make sure that the texture named ``ShoreDistance`` is created for the water mesh.
ru: В зависимости от размера текстуры и количества вершин в обрабатываемых мешах время выполнения скрипта варьируется от долей секунды до нескольких минут. Убедиться, что в меше воды создана текстура с названием ``ShoreDistance``.

source: Upon script execution some system properties are saved in the water material. Therefore, the scene must be saved after the script has finished working.
ru: При вызове скрипта в материале воды сохраняются некоторые системные свойства. Поэтому, после его работы обязательно нужно сохранять сцену.

source: Atmosphere
ru: Атмосфера

source: Scattering
ru: Рассеивание

source: Enable ``World > Render Sky``, then activate ``Procedural Sky`` panel under the World tab. Please note, that if a :ref:`static skydome texture <skydome_texture>` is being used at the same time, it will be replaced.
ru: Во вкладке ``World`` активировать панель ``Procedural Sky``, предварительно выставив опцию ``World > Render Sky``. Если одновременно с этим используется статическая :ref:`текстура неба <skydome_texture>`, она будет заменена.

source: Also, a procedural sky texture can be used to imitate scattered :ref:`environment lighting <environment_lighting>` similar to the :ref:`static skydome texture <skydome_texture>`. To do this, enable the ``Procedural Sky > Use as Environment Lighting`` and ``Environment Lighting > Sky Texture`` options. If the world texture for environment lighting already exists, it will be replaced.
ru: Кроме того, процедурная текстура неба может быть использована для имитации рассеянного :ref:`освещения от окружающей среды <environment_lighting>`, по аналогии со статической :ref:`текстурой неба <skydome_texture>`. Для этого необходимо выставить опции ``Procedural Sky > Use as Environment Lighting`` и ``Environment Lighting > Sky Texture``. Если текстура мира для рассеянного освещения уже существует, она будет заменена.

source: Supported settings:
ru: Движком поддерживаются следующие настройки:

source: Base sky color. The default value is (0.087, 0.255, 0.6) (blue).
ru: Базовый цвет неба. Значение по умолчанию (0.087, 0.255, 0.6) (голубой).

source: Rayleigh scattering brightness (i.e. scattering on small particles). The default value is 3.3.
ru: Яркость рэлеевского рассеяния (на малых частицах). Значение по умолчанию 3.3.

source: Mie scattering brightness (i.e. scattering on large particles). The default value is 0.1.
ru: Яркость рассеяния Ми (на крупных частицах). Значение по умолчанию 0.1.

source: Sun spot brightness. The default value is 20.0.
ru: Яркость пятна солнца. Значение по умолчанию 20.0.

source: Light scattering factor. The default value is 0.2.
ru: Фактор рассеяния света. Значение по умолчанию 0.2.

source: Rayleigh scattering factor. The default value is 0.2.
ru: Фактор рэлеевского рассеяния. Значение по умолчанию 0.2.

source: Mie scattering factor. The default value is 0.006.
ru: Фактор рассеяния Ми. Значение по умолчанию 0.006.

source: Rayleigh scattering exponent. The default value is 0.35.
ru: Степенной коэффициент рэлеевского рассеяния. Значение по умолчанию 0.35.

source: Mie scattering exponent. The default value is 0.5.
ru: Степенной коэффициент рассеяния Ми. Значение по умолчанию 0.5.

source: Mie scattering distribution. The default value is 0.4.
ru: Распределение рассеяния Ми. Значение по умолчанию 0.4.

source: Fog
ru: Туман

source: The engine supports standard parameters located on the ``World > Mist`` panel. Besides this, overriding fog color is possible.
ru: Движком поддерживаются стандартные параметры вкладки ``World > Mist``. Помимо этого возможно переопределение цвета тумана.

source: Fog settings are described in the :ref:`Scene Settings <world_mist>` chapter.
ru: Настройки тумана описаны в главе :ref:`Параметры сцены <world_mist>`.

source: When a dynamic skydome is used, the fog color is defined by the sky color.
ru: При использовании динамического неба цвет тумана определяется цветом неба.

source: Time of Day
ru: Время суток

source: Enable the ``Dynamic Intensity`` options for the lamp.
ru: Для лампы необходимо выставить опцию ``Dynamic Intensity``.

source: Time of day can be set by applications via API. Particularly time of day can be set using the ``Lighting`` interface of the :ref:`Scene viewer <viewer>`.
ru: Время суток устанавливается приложениями с использованием соответствующего API. В частности, время суток может устанавливаться в интерфейсе ``Lighting`` :ref:`просмотрщика сцен <viewer>`.

source: Stars
ru: Звезды

source: Stars setup is described in the :ref:`material_halo` section.
ru: Настройка данного эффекта описывается в разделе :ref:`material_halo`.

source: Lens Flare
ru: Блик (Lens Flare)

source: This feature can be enabled by the ``Lens Flare`` check-box located in the ``Rendering Options`` of the ``Material`` panel.
ru: Включается с помощью опции ``Lens Flare`` на вкладке ``Rendering Options`` панели ``Material``.

source: The effect works only if a ``Sun`` type light source is present in the scene.
ru: Этот эффект работает только в том случае, если в сцене присутствует источник света типа ``Sun``.

source: Lens Flare Settings
ru: Настройки эффекта

source: Lens Flare Object
ru: Объект для бликов линз

source: Lens Flare object is used for the actual rendering of the effect. In essence, such an object consists of several planes with each plane containing one element of the flare. The normal vector of each plane should be pointed in the ``-Y`` direction. Every element can slide across the screen in relation to camera rotation with the sole exception being the central plane (bright white "star" on the picture above). This plane serves as a center of the lens flare object and should have a *local* ``Y`` coordinate set to 1.
ru: Объект используется при визуализации эффекта. По сути, такой объект представляет собой набор плоскостей, каждая из которых содержит один из элементов блика. Нормаль каждой плоскости должна быть направлена в сторону ``-Y``. Каждый элемент блика может двигаться по экрану с поворотом камеры, единственным исключением является центральный элемент (яркая белая "звезда" на изображении выше). Эта плоскость считается центром объекта, и её *локальная* координата ``Y`` должна быть равна 1.

source: The placement and spatial orientation of the object itself are not taken into account during rendering.
ru: Расположение и пространственная ориентация самого объекта при визуализации не учитываются.

source: For lens flare object to work correctly, the ``Disable Frustum Culling`` option should be activated.
ru: Для корректной работы объекта следует включить опцию ``Disable Frustum Culling``.

source: An example of such object can be seen, for example, in our **Island** demo.
ru: Пример использования подобного объекта можно увидеть в нашем демо **Island**.

source: Material Settings
ru: Настройки материала

source: The material used for the lens flare object should have the ``Alpha Blend`` transparency type. ``Alpha`` parameter should be set to zero.
ru: Материал объекта для бликов линз должен иметь тип прозрачности ``Alpha Blend``. Значение параметра ``Alpha`` должно быть равно нулю.

source: :ref:`Node materials <node_materials>` are not supported.
ru: :ref:`Нодовые материалы <node_materials>` не поддерживаются.

source: Texture Settings
ru: Настройки текстуры

source: An example of texture used to generate Lens Flare effect.
ru: Пример использования текстуры для создания эффекта линз.

source: The texture used for the Lens Flare object should contain all elements used to form the shape of the flare in an actual application. The texture image should use ``Alpha`` channel and influence both ``Color`` and ``Alpha`` values.
ru: Все элементы, используемые для изображения блика в приложении, должны находиться на одной текстуре. Текстура должна обладать каналом прозрачности и влиять на значения ``Color`` и ``Alpha``.

source: Wind
ru: Ветер

source: Wind strength and direction affect:
ru: Сила и направление ветра оказывает воздействие на:

source: :ref:`grass and tree leaves animation <wind_bending>`
ru: :ref:`анимацию травы и крон деревьев <wind_bending>`

source: :ref:`particle system dynamics <particles_force_fields>`
ru: :ref:`динамику систем частиц <particles_force_fields>`

source: :ref:`water waves rolling frequency <water_volumetric_waves>` (at the moment only strength is taken into account)
ru: :ref:`частоту колебаний волн воды <water_volumetric_waves>` (в настоящий момент влияет только сила)

source: Add a force field object of the ``Wind`` type.
ru: Добавить на сцену объект - силовое поле типа ``Wind``.

source: *Direction*
ru: *Направление*

source: Direction can be set by rotating the force field object.
ru: Направление задается посредством вращения объекта - силового поля.

source: Wind strength. Located under the ``Physics`` tab. The default value is 1.0.
ru: Сила ветра. Располагается во вкладке ``Physics``. Значение по умолчанию 1.0.

source: Animation of Grass and Tree Leaves
ru: Анимация травы и крон деревьев

source: Authoring resources for grass rendering is described in the :ref:`particles_grass` section.
ru: Подготовка ресурсов для рендеринга травы описана в разделе :ref:`particles_grass`.

source: Enable the ``Wind Bending`` panel for the grass or tree object.
ru: На объекте травы или дерева активировать панель ``Wind Bending``.

source: The interface panel becomes visible after turning on the ``Wind Bending`` panel.
ru: Интерфейс для настроек появляется после активации панели ``Wind Bending``.

source: Angle amplitude of the “main” deviation under the influence of wind (in degrees). The default value is 10.0.
ru: Амплитуда угла "основного" отклонения под действием ветра (в градусах). Значение по умолчанию 10.0.

source: Frequency of the “main” deviation under the influence of wind. The default value is 0.25.
ru: Частота "основного" отклонения под действием ветра. Значение по умолчанию 0.25.

source: Text field for specifying the name of the vertex color layer which contains the information about the stiffness of the “main” deviation. Can be left empty.
ru: Текстовое поле для названия слоя вертексного цвета, содержащего информацию о жесткости "основного" отклонения. Может быть оставлено пустым.
