Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/particles.po
Languages: ru

source: Particle System. Fluids
ru: Система частиц. Флюиды

source: Table of Contents
ru: Содержание

source: The particle system is intended to visualize phenomena which are caused by the movement of numerous small objects such as smoke, fire, water splashes and other.
ru: Система частиц предназначена для визуализации явлений, обусловленных движением множественных малых объектов, таких как дым, огонь, брызги воды и др.

source: A particle system requires an emitter - an object which defines the location and the direction of the outgoing particles flow.
ru: Необходимым элементом системы частиц является эмиттер - объект, определяющий местоположение и направление исходящего потока частиц.

source: Usage
ru: Использование

source: Necessary Steps
ru: Необходимые этапы

source: Add a mesh emitter to the scene.
ru: Добавить на сцену меш - эмиттер.

source: Create a material for particles on the emitter, for example of the ``Halo`` type. The ``Surface`` material type with a mandatory diffuse texture is also supported.
ru: Создать на эмиттере материал для частиц, например типа ``Halo``. Поддерживается также материал типа ``Surface`` с обязательной диффузной текстурой.

source: Add a particle system on the emitter.
ru: Добавить на эмиттере систему частиц.

source: Initiate the engine playback. Two options are available:
ru: Инициализировать воспроизведение в движке. Возможны два варианта:

source: "cyclic emission" - enable the ``Emission > Cyclic emission`` option for the particle system and the ``Animation > Apply Default Animation`` for the emitter.
ru: "циклическое испускание" - для системы частиц выставить опцию ``Emission > Cyclic emission``, для эмиттера - ``Animation > Apply Default Animation``.

source: "non-cyclic animation" - enable the ``Animation > Apply Default Animation`` option for the emitter.
ru: "нециклическая анимация" - для эмиттера выставить опцию ``Animation > Apply Default Animation``.

source: Recommended Additional Settings
ru: Рекомендуемые дополнительные настройки

source: Set the ``Add`` transparency type for the particles' material.
ru: Для материала частиц выставить тип прозрачности ``Add``.

source: Disable emitter rendering if needed using the ``Particles > Render > Emitter`` checkbox.
ru: Если отображение эмиттера на сцене не требуется, отключить опцию ``Particles > Render > Emitter``.

source: If an emitter is required on a scene use additional materials for it. In this case select the particles' material in the ``Particles > Render > Material`` menu on the particles settings panel.
ru: Если отображение эмиттера на сцене необходимо, для него можно использовать дополнительные материалы. В этом случае в настройках системы частиц нужно выбрать материал частиц ``Particles > Render > Material``.

source: If the ``Surface`` material type is used it is required to add a diffuse texture (normally with the alpha channel) to this material. Select ``UV`` in the ``Mapping > Coordinates`` menu. Make sure that the emitter's mesh has a UV layer.
ru: В случае использования для частиц материала типа ``Surface``, к материалу необходимо подключить диффузную текстуру (обычно с альфа-каналом). В меню ``Mapping > Coordinates`` выбрать ``UV``. Убедиться, что меш эмиттера имеет развертку.

source: Setup
ru: Настройка

source: The particle system parameters can be set up under the ``Particles`` tab. Multiple particle systems per emitter are supported.
ru: Параметры системы частиц настраиваются во вкладке ``Particles``. Поддерживается несколько систем частиц на одном эмиттере.

source: Basic Settings
ru: Общие настройки

source: Particle system name. The default name is "ParticleSystem".
ru: Название системы частиц. Значение по умолчанию "ParticleSystem".

source: Reference to the settings datablock of the particle system. The datablock settings can be shared between different particle systems.
ru: Ссылка на блок данных с настройками системы частиц. Блоки данных с настройками могут быть общими для разных систем частиц.

source: Particle system type: ``Emitter`` or ``Hair``. ``Hair`` particle systems can be used to create numerous copies of an object (so called instancing). The default is ``Emitter``.
ru: Тип системы частиц: ``Emitter`` или ``Hair``. Системы частиц типа ``Hair`` используются для создания множественных копий (инстансинга) объектов. Значение по умолчанию ``Emitter``.

source: Index in the table of random numbers which are used for particle system generation. The default value is 0.
ru: Индекс в таблице случайных чисел, используемых для генерации системы частиц. Значение по умолчанию 0.

source: Emission Settings
ru: Настройки испускания

source: Number of particles. The default value is 1000.
ru: Количество частиц. Значение по умолчанию 1000.

source: The first frame after which the emission of particles starts. The default value is 1.0.
ru: Первый кадр, после которого начинается испускание частиц. Значение по умолчанию 1.0.

source: The last frame after which the emission of particles ends. The default value is 200.0.
ru: Последний кадр, после которого прекращается испускание частиц. Значение по умолчанию 200.0.

source: The lifetime of particles measured in frames. The default value is 50.0.
ru: Время жизни частиц в кадрах. Значение по умолчанию 50.0.

source: The random factor for the lifetime. The default value is 0.0.
ru: Фактор случайности для времени жизни. Значение по умолчанию 0.0.

source: Emission source type. The following types are supported: ``Verts`` (emit from vertices), ``Faces`` (emit from polygons). The default is ``Faces``.
ru: Источник испускания. Поддерживаются вершины ``Verts``, грани ``Faces``. Значение по умолчанию ``Faces``.

source: The option enables the cyclic emission mode. It can be used for permanent effects (such as smoke, burning, water splashes). It is recommended to set the ``Emission > Start`` value to zero. Disabled by default.
ru: Опция включает циклический режим испускания. Применяется для постоянных эффектов (дым, горение, брызги). Рекомендуется выставить нулевое значение ``Emission > Start``. По умолчанию выключено.

source: Activating this option allows particle emission to be controlled by NLA. Enabled by default.
ru: Если эта опция включена, испускание частиц может контролироваться с помощью NLA. По умолчанию активировано.

source: The option enables a random emission time for particles. Disabled by default.
ru: Опция устанавливает случайный характер времени испускания частиц. По умолчанию выключено.

source: Direction Settings
ru: Настройки направления

source: Factor influencing the emission along the emitter's mesh normals. The default value is 1.0.
ru: Фактор влияния на испускание вдоль нормалей меша эмиттера. Значение по умолчанию 1.0.

source: Factor of randomization for emission direction. The default value is 0.0.
ru: Фактор случайности для направления испускания. Значение по умолчанию 0.0.

source: Rotation Settings
ru: Настройки вращения

source: Mode for particle billboards self-rotating. ``Hair`` particle system supports all the types of rotation and ``Emitter`` supports only ``Velocity``.
ru: Режим собственного вращения билбордов частиц. Система частиц типа ``Hair`` поддерживает все типы вращения, а система частиц типа ``Emitter`` только ``Velocity``

source: Factor of rotation velocity for particle billboards. The default value is 0.0.
ru: Фактор скорости собственного вращения билбордов частиц. Значение по умолчанию 0.0.

source: Physics Settings
ru: Настройки физики

source: Physics calculation type: ``No``, ``Newtonian``, ``Keyed``, ``Boids``, ``Fluid``. Ignored by the engine. ``Newtonian`` physics is always used. The default is ``Newtonian``.
ru: Тип расчетов физики: ``No``, ``Newtonian``, ``Keyed``, ``Boids``, ``Fluid``. Игнорируется движком. Всегда используется физика Ньютона (``Newtonian``). Значение по умолчанию ``Newtonian``.

source: Particle size. The default value is 0.05.
ru: Размер частиц. Значение по умолчанию 0.05.

source: Particle mass. Affects interaction with force fields (such as wind). The default value is 1.0.
ru: Масса частиц. Влияет на взаимодействие с силовыми полями (в частности, с ветром). Значение по умолчанию 1.0.

source: Exported but not used by the engine.
ru: Экспортируется, но не используется движком.

source: Rendering Settings
ru: Настройки отображения

source: Menu for selecting the particle's material. Used for referencing to the particle' material in case multiple materials are used by the emitter. The default value is ``Default Material``.
ru: Меню выбора материала частиц. Используется в случае использования эмиттером нескольких материалов. Значение по умолчанию ``Default Material``.

source: Enables emitter rendering on the scene. Enabled by default.
ru: Опция включения отображения эмиттера на сцене. По умолчанию включено.

source: Particle rendering mode: ``None``, ``Halo``, ``Line``, ``Path``, ``Object``, ``Group``, ``Billboard``. The engine supports the ``Object`` and the ``Group`` modes which are used for objects and groups instancing respectively. Other modes are ignored. It is recommended to use the ``Billboard`` mode for convenient display of billboards. The default is ``Halo``.
ru: Режим отображения частиц: ``None``, ``Halo``, ``Line``, ``Path``, ``Object``, ``Group``, ``Billboard``. Движком различаются режимы ``Object`` и ``Group``, использующиеся для инстансинга объектов и групп объектов, соответственно. Другие режимы игнорируются. Для удобства отображения билбордов рекомендуется включать режим ``Billboard``. Значение по умолчанию ``Halo``.

source: The way billboards are oriented: ``View`` - follow the camera, ``XY plane``, ``YZ plane``, ``ZX plane`` - align to the corresponding plane (in the world coordinate system of Blender). The default is ``View``.
ru: Способ ориентирования билбордов: ``View`` - поворачивать к камере, ``XY plane``, ``YZ plane``, ``ZX plane`` - ориентировать в соответствующей плоскости (в мировой системе координат Blender'a). Значение по умолчанию ``View``.

source: This group of parameters controls the initial tilt of the billboard planes. It consists of two parameters:
ru: Эта группа параметров управляет начальным наклоном билбордов. Включает два параметра:

source: Rotation angle of the billboard planes. Its value can vary from -1 to 1. The value of 1 rotates by 180 degrees (i.e. turns the billboard upside down). Set to zero by default.
ru: Угол поворота билбордов. Значение может меняться от -1 до 1. Значение, равное 1, поворачивает билборд на 180 градусов (т.е., переворачивает его вверх ногами). По умолчанию значение равно нулю.

source: Random variation of tilt. Its value can change from zero to 1 and is set to zero by default.
ru: Случайное изменение угла наклона. Может принимать значения от 0 до 1. По умолчанию равно нулю.

source: Render > Dissolve intervals > Fade-in* and *Fade-out*
ru: *Render > Dissolve Intervals > Fade-in* и *Fade-out*

source: Starting and ending intervals (measured in frames) for gradually increasing and decreasing the particles' transparency.
ru: Начальный и конечный интервалы (в кадрах) для постепенного увеличения и уменьшения прозрачности частиц.

source: Coordinate system of emitting particles: ``Local`` - use local coordinate system of the emitter object, ``World`` - use world coordinate system.
ru: Система координат испускаемых частиц: ``Local`` - использовать локальную систему координат эмиттера, ``World`` - использовать мировую систему координат.

source: Support for soft particles, billboards of which smoothly dissolve when contacting with surfaces. Use the ``Particle Softness`` slider to tweak this effect.
ru: Включает так называемые "Мягкие частицы" билборды которых плавно растворяются при соприкосновении с поверхностями. С помощью слайдера Particle Softness настраивается степень проявленности этого эффекта.

source: Supported Settings for Force Field Influence
ru: Настройки влияния силовых полей

source: Gravity influence factor (Earth's attraction). The default value is 1.0.
ru: Фактор влияния гравитационного поля (земное притяжение). Значение по умолчанию 1.0.

source: Wind influence factor. A ``Wind`` force field source should be present (can be added using ``Add > Force Field``). A particle system is also influenced by the wind direction and strength. The default value is 1.0.
ru: Фактор влияния ветра. Необходимо присутствие объекта силового поля (добавляется ``Add > Force Field``) типа ``Wind`` (ветер). На систему частиц оказывают также настройки направления и силы ветра. Значение по умолчанию 1.0.

source: Engine Specific Settings
ru: Специальные настройки движка

source: Don't export.
ru: Не экспортировать.

source: Textures in Particle Systems
ru: Текстуры в системах частиц

source: Particle systems support both standard and node materials. Supported material types are ``Surface`` and ``Halo``. All additional settings of the ``Halo`` type materials, such as ``Rings``, ``Lines`` and ``Star Tips``, are also supported.
ru: Системы частиц поддерживают как стандартные, так и нодовые материалы типа ``Surface`` и ``Halo``. При использовании материала типа ``Halo`` также поддерживаются все его дополнительные настройки, такие как ``Rings``, ``Lines`` и ``Star Tips``.

source: Textures of the Particle's Material
ru: Текстуры материала частиц

source: For the ``Surface`` particle's materials it is **required** to have a diffuse texture (normally with an alpha-channel). In the ``Mapping > Coordinates`` menu choose the ``UV`` option. Make sure that the emitter's mesh has a UV layer.
ru: В материалах частиц типа ``Surface`` **необходимо** наличие диффузной текстуры (обычно с альфа-каналом). В меню ``Mapping > Coordinates`` выбрать ``UV``. Убедиться, что меш эмиттера имеет развертку.

source: For the ``Halo`` particle's materials it is **possible** to use a ``Blend`` texture with a ``Linear`` gradient. In the ``Mapping > Coordinates`` menu choose the ``Strand / Particle`` option. It is required to enable ``Ramp`` on a texture.
ru: В материалах частиц типа ``Halo`` **возможно** использование текстуры типа ``Blend`` с линейным (``Linear``) градиентом. В меню ``Mapping > Coordinates`` выбрать ``Strand / Particle``. На текстуре необходимо включить использование рампы (``Ramp``).

source: Textures of Particle Systems
ru: Текстуры системы частиц

source: Textures can also be used for setting up the behavior of particle systems. Unlike textures for particle materials such textures belong to the particle system datablock, not to the material datablock. To create a texture for the particle system it is required to go **from** the ``Particles`` tab to the ``Textures`` tab and then to click the ``New`` button.
ru: Для настройки поведения системы частиц могут быть использованы текстуры. В отличие от текстур, используемых материалами частиц, такие текстуры относятся к блоку данных (datablock) системы частиц, а не к блоку данных материала. Чтобы создать текстуру системы частиц, необходимо **из вкладки** ``Particles`` перейти во вкладку ``Textures``, после чего нажать ``New``.

source: The only supported type of textures is ``Blend`` with a ``Linear`` gradient. ``Ramp`` should be enabled on the texture. Up to 4 gradient control points are supported.
ru: Поддерживаются только текстуры типа ``Blend`` с линейным (``Linear``) градиентом. На текстуре необходимо включить использование рампы (``Ramp``). Допускается использование до 4 контрольных точек градиента.

source: On the ``Influence`` panel choose the parameter which is influenced by the texture. At the moment the only supported parameter is ``Size``.
ru: На панели ``Influence`` необходимо выбрать параметр, на который воздействует текстура. В настоящий момент поддерживается только ``Size`` (размер).

source: The result of using gradient textures on the particle material and the particle system:
ru: Результат применения текстур градиента для материала частиц и для системы частиц:

source: `The original model was taken from here <http://www.blendswap.com/blends/view/13977>`_
ru: `Ссылка на модель <http://www.blendswap.com/blends/view/13977>`_

source: particle system
ru: система частиц

source: fluids
ru: флюиды
