Repository: TriumphLLC/Blend4Web
Catalog: doc_src/locale/*/LC_MESSAGES/stereo_rendering.po
Languages: ru

source: Stereo Rendering
ru: Стереоизображение

source: Table of Contents
ru: Содержание

source: The stereoscopic rendering mode is intended for viewing the content using special glasses. It is activated by an application via API.
ru: Режим стереоизображения предназначен для просмотра контента в специальных очках и активируется приложением.

source: Blend4Web supports two techniques of the stereo image rendering - anaglyph image and the HMD (head-mounted display).
ru: Blend4Web поддерживает два стереорежима - анаглифное изображение и HMD (Head-mounted display, шлем виртуальной реальности).

source: Anaglyph:
ru: Анаглиф:

source: HMD is an experimental feature, for now it works only with the ``Eye`` type cameras.
ru: HMD - экспериментальная возможность, она работает только с камерами типа ``Eye``.

source: Activation
ru: Активация

source: To use HMD stereo rendering, you need to install Oculus' `runtime utility <https://developer.oculus.com/downloads/>`_ (two versions are supported: the `chromium_webvr_v1_win64.7z` in the root directory and the one in the `Deprecated API` folder). Windows and macOS versions can be found on the Oculus website in binary format, while Linux version should be compiled from the source code.
ru: Для работы стереорежима HMD нужно установить `runtime-утилиту <https://developer.oculus.com/downloads/>`_ от Oculus (поддерживаются две версии: `chromium_webvr_v1_win64.7z` в корневой директории и версия в папке `Deprecated API`). Версии для Windows и macOS присутствуют на сайте Oculus в бинарном формате, версию утилиты для Linux пользователю понадобится собирать из исходников самостоятельно.

source: For now, the HMD is supported by the `Chromium experimental builds <https://webvr.info/get-chrome/>`_ and in the `Firefox nightly builds <https://nightly.mozilla.org/>`_.
ru: На сегодняшний день HMD поддерживается в экспериментальных сборках `Chromium <https://webvr.info/get-chrome/>`_ и в nightly build `Firefox <https://nightly.mozilla.org/>`_.

source: `Chromium settings. <https://docs.google.com/document/d/1g02qHfX85vSRSOkWm9k33I0b7VuyN79md9U9t6MIa4E/edit>`_
ru: `Настройки Chromium. <https://docs.google.com/document/d/1g02qHfX85vSRSOkWm9k33I0b7VuyN79md9U9t6MIa4E/edit>`_

source: `Firefox settings. <https://developer.mozilla.org/en-US/docs/Web/API/WebVR_API>`_
ru: `Настройки Firefox. <https://developer.mozilla.org/en-US/docs/Web/API/WebVR_API>`_

source: To turn the stereo rendering on, you need to choose certain option in the settings, in the third column from the right, as shown on the picture.
ru: Чтобы включить стереорежим, нужно выбрать соответствующий пункт в настройках приложения, в третьем столбце справа, как показано на иллюстрации.

source: For stereo rendering to work correctly, switching to the full screen mode is recommended.
ru: Для корректной работы рекомендуется включить полноэкранный режим.

source: Additional Settings
ru: Дополнительные настройки

source: None.
ru: Отсутствуют.

source: HMD Settings
ru: Настройки HMD

source: This group of settings allows a user to change various parameters in order to adjust whatever VR device they have to better view a certain 3D application or scene. There are two ways these settings can be accessed:
ru: Эта группа настроек позволяет пользователю регулировать различные параметры для максимально комфортного просмотра 3D-сцены или приложения на своём VR-устройстве. Получить доступ к настройкам можно двумя способами:

source: Firstly, it can be found in the :ref:`Blend4Web Viewer <viewer>` application under the :ref:`Stereo View tab <stereo_view>`.
ru: Во-первых, с помощью :ref:`панели Stereo View <stereo_view>` в :ref:`Просмотрщике сцен Blend4Web <viewer>`.

source: And secondly, it can also be shown in an application by using the :b4wref:`hmd_conf.show` method of the :b4wmod:`hmd_conf` module, but doing this requires some programming. Examples of this method can be found in the ``viewer.js`` and ``webplayer.js`` applications (in the ``m_hmd_conf`` object).
ru: Во-вторых, с использованием в приложении метода :b4wref:`hmd_conf.show` из модуля :b4wmod:`hmd_conf`, для чего требуется написание программного кода. Примеры использования этого метода можно увидеть в приложениях ``viewer.js`` и ``webplayer.js`` (в объекте ``m_hmd_conf``).

source: This allows user to select a profile for a specific device. Currently, the following profiles are available:
ru: Позволяет пользователю выбрать профиль для определённого устройства. На сегодняшний день поддерживаются следующие профили:

source: By default, `Custom` profile is selected.
ru: По умолчанию выбран профиль `Custom`.

source: Rendering Settings
ru: Настройки рендеринга

source: This parameter specifies the distance between the phone frame and the center of the camera lenses.
ru: Задаёт расстояние между корпусом телефона и линзами камеры.

source: This value can vary from 0 to 50. Default value is 32.
ru: Значение может меняться от 0 до 50. Значение по умолчанию - 32.

source: This parameter specifies the distance between the pupils of the user's eyes. Measured in millimeters.
ru: Задаёт расстояние (в миллиметрах) между зрачками глаз пользователя.

source: This value can vary from 0 to 100. Default value is 64.
ru: Значение может меняться от 0 до 100. Значение по умолчанию - 64.

source: This specifies the distance between the screen of the phone and the camera lenses.
ru: Задаёт расстояние между экраном телефона и линзами камеры.

source: This value can vary from 0 to 100. Default value is 50.
ru: Значение может меняться от 0 до 100. Значение по умолчанию - 50.

source: The height of the screen.
ru: Высота экрана.

source: This value can vary from 0 to 150. Default value is 63.
ru: Значение может меняться от 0 до 150. Значение по умолчанию - 63.

source: The width of the screen.
ru: Ширина экрана.

source: This value can vary from 0 to 200. Default value is 107.
ru: Значение может меняться от 0 до 200. Значение по умолчанию - 107.

source: The thickness of the border around the image.
ru: Ширина рамки вокруг изображения.

source: This value can vary from 0 to 20. Default value is 3.
ru: Значение может меняться от 0 до 20. Значение по умолчанию - 3.

source: This is used in order to compensate image distortion produced by the VR device lenses.
ru: Используются для компенсации искажений, вносимых в изображение линзами VR-устройства.

source: Both values can vary from 0 to 1. Default values are 0.34 for the first parameter and 0.55 for the second one.
ru: Оба значения могут меняться от 0 до 1. Значения по умолчанию: 0.34 для первого параметра и 0.55 для второго.

source: Other control tools
ru: Другие инструменты управления

source: Saves the settings.
ru: Сохраняет настройки.

source: Closes the setting interface without saving the settings.
ru: Закрывает окно настроек без сохранения изменений.

source: Restores default settings.
ru: Восстанавливает настройки по умолчанию.

source: anaglyph
ru: анаглиф
